/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tkirihar <tkirihar@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/08 16:06:07 by tkirihar          #+#    #+#             */
/*   Updated: 2021/12/19 21:38:45 by tkirihar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/* 第2引数のバイト分第1引数のメモリに0をセットする関数 */
void	ft_bzero(void *s, size_t len)
{
	char	*p;
	size_t	i;

	i = 0;
	p = (char *)s;
	while (len-- > 0)
		p[i++] = '\0';
	return ;
}
